import { getUnelgeeStudents } from '@/utils'

const registerNumbers = [
  'УП08252058',
  'УХ08312400',
  'УЦ08311282',
  'УХ08242737',
  'УЛ08250313',
  'УЛ08230451',
  'УК08260625',
  'УХ08271108',
  'УО08320679',
  'СЩ08260175',
  'УТ08221493',
  'УК08320885',
  'УА08272142',
  'ЙР08230339',
  'НХ08222534',
  'УЛ08241190',
  'УЖ08243043',
  'БЮ08260914',
  'ЩЙ07311739',
  'МЮ08312311',
  'УХ08282405',
  'УП09301419',
  'УК09233042',
  'РЙ08271515',
  'ИЭ08281715',
  'УЦ08242360',
  'УА08230575',
  'УЖ08271501',
  'НЮ08302411',
  'УК08241908',
  'УХ08222077',
  'СЮ08272699',
  'УЖ08293079',
  'УЦ08322761',
  'МХ08320698',
  'УП08250866',
  'УХ08262349',
  'СЛ08322001',
  'УК08241236',
  'УО08220221',
  'УЦ08321199',
  'УК08222231'
]

export async function GET(_request: Request) {
  const responseData = await getUnelgeeStudents(registerNumbers, '11a')

  return Response.json({
    status: 200,
    data: responseData
  })
}
